Revit 2024 API
UnitTypeId.SquareFeet Property
 Square feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId SquareFeet { get; }
Visual Basic
Public Shared ReadOnly Property SquareFeet As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SquareFeet {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace